INSERT INTO theory_step ( theory_text,
    theory_image,  
    plan_id,  
    plan_step_id) VALUES (
                             'Алгоритми сортування — це методи впорядкування елементів у масиві або списку за певним критерієм, зазвичай за зростанням або спаданням.
                             Вони є основою для багатьох інших алгоритмів і важливі в програмуванні, оскільки дозволяють ефективно обробляти та аналізувати дані. Сортування оптимізує пошук, покращує швидкість роботи інших алгоритмів (наприклад, пошук бінарним методом) та забезпечує зручність для користувачів у роботі з великими обсягами даних.
                             Різні алгоритми сортування мають різну складність і підходять для різних типів задач, тому важливо вибирати правильний алгоритм з',
                             'PATH', 1, 2),(
'Алгоритми сортування — це методи впорядкування елементів у масиві або списку за певним критерієм, зазвичай за зростанням або спаданням.
Вони є основою для багатьох інших алгоритмів і важливі в програмуванні, оскільки дозволяють ефективно обробляти та аналізувати дані. Сортування оптимізує пошук, покращує швидкість роботи інших алгоритмів (наприклад, пошук бінарним методом) та забезпечує зручність для користувачів у роботі з великими обсягами даних.
Різні алгоритми сортування мають різну складність і підходять для різних типів задач, тому важливо вибирати правильний алгоритм з',
'PATH', 1, 2),
 (
'Алгоритми сортування — це методи впорядкування елементів у масиві або списку за певним критерієм, зазвичай за зростанням або спаданням.
Вони є основою для багатьох інших алгоритмів і важливі в програмуванні, оскільки дозволяють ефективно обробляти та аналізувати дані. Сортування оптимізує пошук, покращує швидкість роботи інших алгоритмів (наприклад, пошук бінарним методом) та забезпечує зручність для користувачів у роботі з великими обсягами даних.
Різні алгоритми сортування мають різну складність і підходять для різних типів задач, тому важливо вибирати правильний алгоритм з',
'PATH', 1, 3),
 (
'Алгоритми сортування — це методи впорядкування елементів у масиві або списку за певним критерієм, зазвичай за зростанням або спаданням.
Вони є основою для багатьох інших алгоритмів і важливі в програмуванні, оскільки дозволяють ефективно обробляти та аналізувати дані. Сортування оптимізує пошук, покращує швидкість роботи інших алгоритмів (наприклад, пошук бінарним методом) та забезпечує зручність для користувачів у роботі з великими обсягами даних.
Різні алгоритми сортування мають різну складність і підходять для різних типів задач, тому важливо вибирати правильний алгоритм з',
'PATH', 1, 4)
;